#### Terraform Format and Style: `failure`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`
<details><summary>Show Plan</summary>
```

terraform
data.aws_ami.ubuntu: Reading...
aws_key_pair.rdx_key: Refreshing state... [id=rdx-key]
data.aws_availability_zones.available: Reading...
aws_vpc.rdx_vpc: Refreshing state... [id=vpc-01be0f986a7878346]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0778521d914d23bc1]
aws_subnet.rdx_private_subnet[1]: Refreshing state... [id=subnet-0d23844f7d5e4a851]
aws_subnet.rdx_private_subnet[0]: Refreshing state... [id=subnet-0f617db90acf7f670]
aws_route_table.rdx_private_route_table: Refreshing state... [id=rtb-0b6e37ef883e2a9b6]
aws_subnet.rdx_public_subnet[0]: Refreshing state... [id=subnet-0f213ac27ca1fa049]
aws_internet_gateway.rdx_internet_gateway: Refreshing state... [id=igw-0ae10b0dfbad9fa29]
aws_security_group.rdx_private_security_group: Refreshing state... [id=sg-0fbd274ea9da10132]
aws_security_group.rdx_public_security_group: Refreshing state... [id=sg-04f25d8bf49a784be]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07954d7088027aed9]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-043db498032daca52]
aws_db_subnet_group.rdx_private_subnet_group: Refreshing state... [id=rdx_private_subnet_group]
aws_route_table.rdx_public_route_table: Refreshing state... [id=rtb-0c962ab882059ed67]
aws_security_group_rule.rdx_public_security_group_rules_egress[0]: Refreshing state... [id=sgrule-1403434119]
aws_security_group_rule.rdx_public_security_group_rules_ingress[2]: Refreshing state... [id=sgrule-1887156502]
aws_instance.full_node_ec2[0]: Refreshing state... [id=i-0785e5f94482f5e42]
aws_security_group_rule.rdx_private_security_group_rules[0]: Refreshing state... [id=sgrule-702189437]
aws_security_group_rule.rdx_public_security_group_rules_ingress[1]: Refreshing state... [id=sgrule-3439511454]
aws_security_group_rule.rdx_public_security_group_rules_ingress[0]: Refreshing state... [id=sgrule-2221829448]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09bb72b8516db86c9]
aws_eip.fullnode_ips[0]: Refreshing state... [id=eipalloc-0500f018d12e561e6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.fullnode_ips[0] will be updated in-place
  ~ resource "aws_eip" "fullnode_ips" {
        id                   = "eipalloc-0500f018d12e561e6"
      ~ instance             = "i-0785e5f94482f5e42" -> (known after apply)
        tags                 = {
            "Name" = "Full Node IP 1"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_instance.full_node_ec2[0] must be replaced
-/+ resource "aws_instance" "full_node_ec2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:438305056349:instance/i-0785e5f94482f5e42" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0785e5f94482f5e42" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ key_name                             = (sensitive value) # forces replacement
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-002cf1ee1446ddf6e" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-90.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.90" -> (known after apply)
      ~ public_dns                           = "ec2-52-6-232-70.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.6.232.70" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "Full Node 1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-054261c3cc4c86bd1" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Pushed by: @StatelessOddity, Action: `pull_request`*